Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementSingleAttributes.StraightEndSymbolType Property
 Defines how the straight ends of reinforcing bars should look like.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.StraightEndSymbolTypes StraightEndSymbolType { get; set; }
Public Property StraightEndSymbolType As ReinforcementBase.StraightEndSymbolTypes
	Get
	Set
Property Value
Type: ReinforcementBase.StraightEndSymbolTypes
See Also
Reference
ReinforcementBase.ReinforcementSingleAttributes Class
Tekla.Structures.Drawing Namespace